//
//  WeatherCodes.swift
//  TheWeather
//
//  Created by Victoria Isaeva on 15.08.2024.
//

import Foundation

let weatherCodes: [Int: String] = [
    0: "Ясное небо",
    1: "В основном ясно",
    2: "Небольшая облачность",
    3: "Пасмурно",
    45: "Туман",
    48: "Туман с инеем",
    51: "Легкий моросящий дождь",
    53: "Умеренный моросящий дождь",
    55: "Сильный моросящий дождь",
    56: "Легкий дождь с обледенением",
    57: "Сильный дождь с обледенением",
    61: "Легкий дождь",
    63: "Умеренный дождь",
    65: "Сильный дождь",
    66: "Легкий дождь с обледенением",
    67: "Сильный дождь с обледенением",
    71: "Легкий снегопад",
    73: "Умеренный снегопад",
    75: "Сильный снегопад",
    77: "Снежные крупинки",
    80: "Небольшой ливень",
    81: "Умеренный ливень",
    82: "Сильный ливень",
    85: "Легкий снежный дождь",
    86: "Сильный снежный дождь",
    95: "Гроза",
    96: "Гроза с легким градом",
    99: "Гроза с сильным градом"
]

let weatherImages: [String: String] = [
    "Ясное небо": "weather6",
    "В основном ясно": "weather6",
    "Небольшая облачность": "weather1",
    "Пасмурно": "weather7",
    "Туман": "weather7",
    "Туман с инеем": "weather7",
    "Легкий моросящий дождь": "weather3",
    "Умеренный моросящий дождь": "weather3",
    "Сильный моросящий дождь": "weather3",
    "Легкий дождь с обледенением": "weather4",
    "Сильный дождь с обледенением": "weather4",
    "Легкий дождь": "weather3",
    "Умеренный дождь": "weather3",
    "Сильный дождь": "weather3",
    "Легкий снегопад": "weather4",
    "Умеренный снегопад": "weather4",
    "Сильный снегопад": "weather4",
    "Снежные крупинки": "weather4",
    "Небольшой ливень": "weather4",
    "Умеренный ливень": "weather4",
    "Сильный ливень": "weather4",
    "Легкий снежный дождь": "weather4",
    "Сильный снежный дождь": "weather4",
    "Гроза": "weather2",
    "Гроза с легким градом": "weather2",
    "Гроза с сильным градом": "weather2"
]
